ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR3_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR3 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G1" acronym="CONTROLSS_PWMXBAR3_G1" offset="452" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR3 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G2" acronym="CONTROLSS_PWMXBAR3_G2" offset="456" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR3 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G3" acronym="CONTROLSS_PWMXBAR3_G3" offset="460" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR3 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G4" acronym="CONTROLSS_PWMXBAR3_G4" offset="464" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G5" acronym="CONTROLSS_PWMXBAR3_G5" offset="468" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G6" acronym="CONTROLSS_PWMXBAR3_G6" offset="472" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G7" acronym="CONTROLSS_PWMXBAR3_G7" offset="476" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR3 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR3_G8" acronym="CONTROLSS_PWMXBAR3_G8" offset="480" width="32" description="PWM XBAR 3 Input Select.">
		<bitfield id="PWMXBAR3_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR3 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G0" acronym="CONTROLSS_PWMXBAR4_G0" offset="512" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR4 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G1" acronym="CONTROLSS_PWMXBAR4_G1" offset="516" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR4 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G2" acronym="CONTROLSS_PWMXBAR4_G2" offset="520" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR4 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G3" acronym="CONTROLSS_PWMXBAR4_G3" offset="524" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR4 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G4" acronym="CONTROLSS_PWMXBAR4_G4" offset="528" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G5" acronym="CONTROLSS_PWMXBAR4_G5" offset="532" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G6" acronym="CONTROLSS_PWMXBAR4_G6" offset="536" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G7" acronym="CONTROLSS_PWMXBAR4_G7" offset="540" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR4 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR4_G8" acronym="CONTROLSS_PWMXBAR4_G8" offset="544" width="32" description="PWM XBAR 4 Input Select.">
		<bitfield id="PWMXBAR4_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR4 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G0" acronym="CONTROLSS_PWMXBAR5_G0" offset="576" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR5 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G1" acronym="CONTROLSS_PWMXBAR5_G1" offset="580" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR5 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G2" acronym="CONTROLSS_PWMXBAR5_G2" offset="584" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR5 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G3" acronym="CONTROLSS_PWMXBAR5_G3" offset="588" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR5 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G4" acronym="CONTROLSS_PWMXBAR5_G4" offset="592" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G5" acronym="CONTROLSS_PWMXBAR5_G5" offset="596" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G6" acronym="CONTROLSS_PWMXBAR5_G6" offset="600" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G7" acronym="CONTROLSS_PWMXBAR5_G7" offset="604" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR5 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR5_G8" acronym="CONTROLSS_PWMXBAR5_G8" offset="608" width="32" description="PWM XBAR 5 Input Select.">
		<bitfield id="PWMXBAR5_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR5 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G0" acronym="CONTROLSS_PWMXBAR6_G0" offset="640" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR6 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G1" acronym="CONTROLSS_PWMXBAR6_G1" offset="644" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR6 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G2" acronym="CONTROLSS_PWMXBAR6_G2" offset="648" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR6 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G3" acronym="CONTROLSS_PWMXBAR6_G3" offset="652" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR6 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G4" acronym="CONTROLSS_PWMXBAR6_G4" offset="656" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G5" acronym="CONTROLSS_PWMXBAR6_G5" offset="660" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G6" acronym="CONTROLSS_PWMXBAR6_G6" offset="664" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G7" acronym="CONTROLSS_PWMXBAR6_G7" offset="668" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR6 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR6_G8" acronym="CONTROLSS_PWMXBAR6_G8" offset="672" width="32" description="PWM XBAR 6 Input Select.">
		<bitfield id="PWMXBAR6_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR6 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G0" acronym="CONTROLSS_PWMXBAR7_G0" offset="704" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR7 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G1" acronym="CONTROLSS_PWMXBAR7_G1" offset="708" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR7 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G2" acronym="CONTROLSS_PWMXBAR7_G2" offset="712" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR7 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G3" acronym="CONTROLSS_PWMXBAR7_G3" offset="716" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR7 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G4" acronym="CONTROLSS_PWMXBAR7_G4" offset="720" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G5" acronym="CONTROLSS_PWMXBAR7_G5" offset="724" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G6" acronym="CONTROLSS_PWMXBAR7_G6" offset="728" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G7" acronym="CONTROLSS_PWMXBAR7_G7" offset="732" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR7 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR7_G8" acronym="CONTROLSS_PWMXBAR7_G8" offset="736" width="32" description="PWM XBAR 7 Input Select.">
		<bitfield id="PWMXBAR7_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR7 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G0" acronym="CONTROLSS_PWMXBAR8_G0" offset="768" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR8 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G1" acronym="CONTROLSS_PWMXBAR8_G1" offset="772" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR8 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G2" acronym="CONTROLSS_PWMXBAR8_G2" offset="776" width="32" description="PWM XBAR 8 Input Select.">
