ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR8_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR8 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G3" acronym="CONTROLSS_PWMXBAR8_G3" offset="780" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR8 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G4" acronym="CONTROLSS_PWMXBAR8_G4" offset="784" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G5" acronym="CONTROLSS_PWMXBAR8_G5" offset="788" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G6" acronym="CONTROLSS_PWMXBAR8_G6" offset="792" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G7" acronym="CONTROLSS_PWMXBAR8_G7" offset="796" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR8 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR8_G8" acronym="CONTROLSS_PWMXBAR8_G8" offset="800" width="32" description="PWM XBAR 8 Input Select.">
		<bitfield id="PWMXBAR8_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR8 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G0" acronym="CONTROLSS_PWMXBAR9_G0" offset="832" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR9 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G1" acronym="CONTROLSS_PWMXBAR9_G1" offset="836" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR9 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G2" acronym="CONTROLSS_PWMXBAR9_G2" offset="840" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR9 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G3" acronym="CONTROLSS_PWMXBAR9_G3" offset="844" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR9 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G4" acronym="CONTROLSS_PWMXBAR9_G4" offset="848" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G5" acronym="CONTROLSS_PWMXBAR9_G5" offset="852" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G6" acronym="CONTROLSS_PWMXBAR9_G6" offset="856" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G7" acronym="CONTROLSS_PWMXBAR9_G7" offset="860" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR9 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR9_G8" acronym="CONTROLSS_PWMXBAR9_G8" offset="864" width="32" description="PWM XBAR 9 Input Select.">
		<bitfield id="PWMXBAR9_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR9 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G0" acronym="CONTROLSS_PWMXBAR10_G0" offset="896" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR10 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G1" acronym="CONTROLSS_PWMXBAR10_G1" offset="900" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR10 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G2" acronym="CONTROLSS_PWMXBAR10_G2" offset="904" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR10 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G3" acronym="CONTROLSS_PWMXBAR10_G3" offset="908" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR10 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G4" acronym="CONTROLSS_PWMXBAR10_G4" offset="912" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G5" acronym="CONTROLSS_PWMXBAR10_G5" offset="916" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G6" acronym="CONTROLSS_PWMXBAR10_G6" offset="920" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G7" acronym="CONTROLSS_PWMXBAR10_G7" offset="924" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR10 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR10_G8" acronym="CONTROLSS_PWMXBAR10_G8" offset="928" width="32" description="PWM XBAR 10 Input Select.">
		<bitfield id="PWMXBAR10_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR10 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G0" acronym="CONTROLSS_PWMXBAR11_G0" offset="960" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR11 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G1" acronym="CONTROLSS_PWMXBAR11_G1" offset="964" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR11 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G2" acronym="CONTROLSS_PWMXBAR11_G2" offset="968" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR11 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G3" acronym="CONTROLSS_PWMXBAR11_G3" offset="972" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR11 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G4" acronym="CONTROLSS_PWMXBAR11_G4" offset="976" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G5" acronym="CONTROLSS_PWMXBAR11_G5" offset="980" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G6" acronym="CONTROLSS_PWMXBAR11_G6" offset="984" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G7" acronym="CONTROLSS_PWMXBAR11_G7" offset="988" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR11 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR11_G8" acronym="CONTROLSS_PWMXBAR11_G8" offset="992" width="32" description="PWM XBAR 11 Input Select.">
		<bitfield id="PWMXBAR11_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR11 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G0" acronym="CONTROLSS_PWMXBAR12_G0" offset="1024" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR12 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G1" acronym="CONTROLSS_PWMXBAR12_G1" offset="1028" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR12 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G2" acronym="CONTROLSS_PWMXBAR12_G2" offset="1032" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR12 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G3" acronym="CONTROLSS_PWMXBAR12_G3" offset="1036" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR12 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G4" acronym="CONTROLSS_PWMXBAR12_G4" offset="1040" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G5" acronym="CONTROLSS_PWMXBAR12_G5" offset="1044" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G6" acronym="CONTROLSS_PWMXBAR12_G6" offset="1048" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G7" acronym="CONTROLSS_PWMXBAR12_G7" offset="1052" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR12 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR12_G8" acronym="CONTROLSS_PWMXBAR12_G8" offset="1056" width="32" description="PWM XBAR 12 Input Select.">
		<bitfield id="PWMXBAR12_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR12 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G0" acronym="CONTROLSS_PWMXBAR13_G0" offset="1088" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR13 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G1" acronym="CONTROLSS_PWMXBAR13_G1" offset="1092" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR13 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G2" acronym="CONTROLSS_PWMXBAR13_G2" offset="1096" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR13 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G3" acronym="CONTROLSS_PWMXBAR13_G3" offset="1100" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR13 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
