ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
	</register><register id="CONTROLSS_PWMXBAR13_G4" acronym="CONTROLSS_PWMXBAR13_G4" offset="1104" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G5" acronym="CONTROLSS_PWMXBAR13_G5" offset="1108" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G6" acronym="CONTROLSS_PWMXBAR13_G6" offset="1112" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G7" acronym="CONTROLSS_PWMXBAR13_G7" offset="1116" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR13 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR13_G8" acronym="CONTROLSS_PWMXBAR13_G8" offset="1120" width="32" description="PWM XBAR 13 Input Select.">
		<bitfield id="PWMXBAR13_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR13 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G0" acronym="CONTROLSS_PWMXBAR14_G0" offset="1152" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR14 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G1" acronym="CONTROLSS_PWMXBAR14_G1" offset="1156" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR14 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G2" acronym="CONTROLSS_PWMXBAR14_G2" offset="1160" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR14 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G3" acronym="CONTROLSS_PWMXBAR14_G3" offset="1164" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR14 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G4" acronym="CONTROLSS_PWMXBAR14_G4" offset="1168" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G5" acronym="CONTROLSS_PWMXBAR14_G5" offset="1172" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G6" acronym="CONTROLSS_PWMXBAR14_G6" offset="1176" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G7" acronym="CONTROLSS_PWMXBAR14_G7" offset="1180" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR14 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR14_G8" acronym="CONTROLSS_PWMXBAR14_G8" offset="1184" width="32" description="PWM XBAR 14 Input Select.">
		<bitfield id="PWMXBAR14_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR14 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G0" acronym="CONTROLSS_PWMXBAR15_G0" offset="1216" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR15 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G1" acronym="CONTROLSS_PWMXBAR15_G1" offset="1220" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR15 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G2" acronym="CONTROLSS_PWMXBAR15_G2" offset="1224" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR15 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G3" acronym="CONTROLSS_PWMXBAR15_G3" offset="1228" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR15 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G4" acronym="CONTROLSS_PWMXBAR15_G4" offset="1232" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G5" acronym="CONTROLSS_PWMXBAR15_G5" offset="1236" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G6" acronym="CONTROLSS_PWMXBAR15_G6" offset="1240" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G7" acronym="CONTROLSS_PWMXBAR15_G7" offset="1244" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR15 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR15_G8" acronym="CONTROLSS_PWMXBAR15_G8" offset="1248" width="32" description="PWM XBAR 15 Input Select.">
		<bitfield id="PWMXBAR15_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR15 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G0" acronym="CONTROLSS_PWMXBAR16_G0" offset="1280" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR16 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G1" acronym="CONTROLSS_PWMXBAR16_G1" offset="1284" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR16 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G2" acronym="CONTROLSS_PWMXBAR16_G2" offset="1288" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR16 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G3" acronym="CONTROLSS_PWMXBAR16_G3" offset="1292" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR16 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G4" acronym="CONTROLSS_PWMXBAR16_G4" offset="1296" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G5" acronym="CONTROLSS_PWMXBAR16_G5" offset="1300" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G6" acronym="CONTROLSS_PWMXBAR16_G6" offset="1304" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G7" acronym="CONTROLSS_PWMXBAR16_G7" offset="1308" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR16 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR16_G8" acronym="CONTROLSS_PWMXBAR16_G8" offset="1312" width="32" description="PWM XBAR 16 Input Select.">
		<bitfield id="PWMXBAR16_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR16 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G0" acronym="CONTROLSS_PWMXBAR17_G0" offset="1344" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR17 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G1" acronym="CONTROLSS_PWMXBAR17_G1" offset="1348" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR17 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G2" acronym="CONTROLSS_PWMXBAR17_G2" offset="1352" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR17 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G3" acronym="CONTROLSS_PWMXBAR17_G3" offset="1356" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR17 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G4" acronym="CONTROLSS_PWMXBAR17_G4" offset="1360" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G5" acronym="CONTROLSS_PWMXBAR17_G5" offset="1364" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G6" acronym="CONTROLSS_PWMXBAR17_G6" offset="1368" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G7" acronym="CONTROLSS_PWMXBAR17_G7" offset="1372" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR17 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR17_G8" acronym="CONTROLSS_PWMXBAR17_G8" offset="1376" width="32" description="PWM XBAR 17 Input Select.">
		<bitfield id="PWMXBAR17_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR17 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G0" acronym="CONTROLSS_PWMXBAR18_G0" offset="1408" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR18 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G1" acronym="CONTROLSS_PWMXBAR18_G1" offset="1412" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR18 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G2" acronym="CONTROLSS_PWMXBAR18_G2" offset="1416" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR18 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G3" acronym="CONTROLSS_PWMXBAR18_G3" offset="1420" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR18 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G4" acronym="CONTROLSS_PWMXBAR18_G4" offset="1424" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G5" acronym="CONTROLSS_PWMXBAR18_G5" offset="1428" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G6" acronym="CONTROLSS_PWMXBAR18_G6" offset="1432" width="32" description="PWM XBAR 18 Input Select.">
