ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR18_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G7" acronym="CONTROLSS_PWMXBAR18_G7" offset="1436" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR18 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR18_G8" acronym="CONTROLSS_PWMXBAR18_G8" offset="1440" width="32" description="PWM XBAR 18 Input Select.">
		<bitfield id="PWMXBAR18_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR18 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G0" acronym="CONTROLSS_PWMXBAR19_G0" offset="1472" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR19 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G1" acronym="CONTROLSS_PWMXBAR19_G1" offset="1476" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR19 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G2" acronym="CONTROLSS_PWMXBAR19_G2" offset="1480" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR19 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G3" acronym="CONTROLSS_PWMXBAR19_G3" offset="1484" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR19 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G4" acronym="CONTROLSS_PWMXBAR19_G4" offset="1488" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G5" acronym="CONTROLSS_PWMXBAR19_G5" offset="1492" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G6" acronym="CONTROLSS_PWMXBAR19_G6" offset="1496" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G7" acronym="CONTROLSS_PWMXBAR19_G7" offset="1500" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR19 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR19_G8" acronym="CONTROLSS_PWMXBAR19_G8" offset="1504" width="32" description="PWM XBAR 19 Input Select.">
		<bitfield id="PWMXBAR19_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR19 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G0" acronym="CONTROLSS_PWMXBAR20_G0" offset="1536" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR20 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G1" acronym="CONTROLSS_PWMXBAR20_G1" offset="1540" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR20 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G2" acronym="CONTROLSS_PWMXBAR20_G2" offset="1544" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR20 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G3" acronym="CONTROLSS_PWMXBAR20_G3" offset="1548" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR20 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G4" acronym="CONTROLSS_PWMXBAR20_G4" offset="1552" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G5" acronym="CONTROLSS_PWMXBAR20_G5" offset="1556" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G6" acronym="CONTROLSS_PWMXBAR20_G6" offset="1560" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G7" acronym="CONTROLSS_PWMXBAR20_G7" offset="1564" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR20 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR20_G8" acronym="CONTROLSS_PWMXBAR20_G8" offset="1568" width="32" description="PWM XBAR 20 Input Select.">
		<bitfield id="PWMXBAR20_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR20 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G0" acronym="CONTROLSS_PWMXBAR21_G0" offset="1600" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR21 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G1" acronym="CONTROLSS_PWMXBAR21_G1" offset="1604" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR21 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G2" acronym="CONTROLSS_PWMXBAR21_G2" offset="1608" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR21 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G3" acronym="CONTROLSS_PWMXBAR21_G3" offset="1612" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR21 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G4" acronym="CONTROLSS_PWMXBAR21_G4" offset="1616" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G5" acronym="CONTROLSS_PWMXBAR21_G5" offset="1620" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G6" acronym="CONTROLSS_PWMXBAR21_G6" offset="1624" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G7" acronym="CONTROLSS_PWMXBAR21_G7" offset="1628" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR21 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR21_G8" acronym="CONTROLSS_PWMXBAR21_G8" offset="1632" width="32" description="PWM XBAR 21 Input Select.">
		<bitfield id="PWMXBAR21_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR21 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G0" acronym="CONTROLSS_PWMXBAR22_G0" offset="1664" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR22 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G1" acronym="CONTROLSS_PWMXBAR22_G1" offset="1668" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR22 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G2" acronym="CONTROLSS_PWMXBAR22_G2" offset="1672" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR22 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G3" acronym="CONTROLSS_PWMXBAR22_G3" offset="1676" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR22 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G4" acronym="CONTROLSS_PWMXBAR22_G4" offset="1680" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G5" acronym="CONTROLSS_PWMXBAR22_G5" offset="1684" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G6" acronym="CONTROLSS_PWMXBAR22_G6" offset="1688" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G7" acronym="CONTROLSS_PWMXBAR22_G7" offset="1692" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR22 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR22_G8" acronym="CONTROLSS_PWMXBAR22_G8" offset="1696" width="32" description="PWM XBAR 22 Input Select.">
		<bitfield id="PWMXBAR22_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR22 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G0" acronym="CONTROLSS_PWMXBAR23_G0" offset="1728" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR23 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G1" acronym="CONTROLSS_PWMXBAR23_G1" offset="1732" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR23 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G2" acronym="CONTROLSS_PWMXBAR23_G2" offset="1736" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR23 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G3" acronym="CONTROLSS_PWMXBAR23_G3" offset="1740" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR23 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G4" acronym="CONTROLSS_PWMXBAR23_G4" offset="1744" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G5" acronym="CONTROLSS_PWMXBAR23_G5" offset="1748" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G6" acronym="CONTROLSS_PWMXBAR23_G6" offset="1752" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G7" acronym="CONTROLSS_PWMXBAR23_G7" offset="1756" width="32" description="PWM XBAR 23 Input Select.">
		<bitfield id="PWMXBAR23_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR23 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR23_G8" acronym="CONTROLSS_PWMXBAR23_G8" offset="1760" width="32" description="PWM XBAR 23 Input Select.">
