ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263X/CONTROLSS_PWMXBAR_CONTROLSS_502D1000h.xml
		<bitfield id="PWMXBAR23_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR23 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G0" acronym="CONTROLSS_PWMXBAR24_G0" offset="1792" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR24 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G1" acronym="CONTROLSS_PWMXBAR24_G1" offset="1796" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR24 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G2" acronym="CONTROLSS_PWMXBAR24_G2" offset="1800" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR24 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G3" acronym="CONTROLSS_PWMXBAR24_G3" offset="1804" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR24 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G4" acronym="CONTROLSS_PWMXBAR24_G4" offset="1808" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G5" acronym="CONTROLSS_PWMXBAR24_G5" offset="1812" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G6" acronym="CONTROLSS_PWMXBAR24_G6" offset="1816" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G7" acronym="CONTROLSS_PWMXBAR24_G7" offset="1820" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR24 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR24_G8" acronym="CONTROLSS_PWMXBAR24_G8" offset="1824" width="32" description="PWM XBAR 24 Input Select.">
		<bitfield id="PWMXBAR24_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR24 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G0" acronym="CONTROLSS_PWMXBAR25_G0" offset="1856" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR25 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G1" acronym="CONTROLSS_PWMXBAR25_G1" offset="1860" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR25 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G2" acronym="CONTROLSS_PWMXBAR25_G2" offset="1864" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR25 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G3" acronym="CONTROLSS_PWMXBAR25_G3" offset="1868" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR25 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G4" acronym="CONTROLSS_PWMXBAR25_G4" offset="1872" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G5" acronym="CONTROLSS_PWMXBAR25_G5" offset="1876" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G6" acronym="CONTROLSS_PWMXBAR25_G6" offset="1880" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G7" acronym="CONTROLSS_PWMXBAR25_G7" offset="1884" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR25 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR25_G8" acronym="CONTROLSS_PWMXBAR25_G8" offset="1888" width="32" description="PWM XBAR 25 Input Select.">
		<bitfield id="PWMXBAR25_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR25 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G0" acronym="CONTROLSS_PWMXBAR26_G0" offset="1920" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR26 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G1" acronym="CONTROLSS_PWMXBAR26_G1" offset="1924" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR26 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G2" acronym="CONTROLSS_PWMXBAR26_G2" offset="1928" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR26 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G3" acronym="CONTROLSS_PWMXBAR26_G3" offset="1932" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR26 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G4" acronym="CONTROLSS_PWMXBAR26_G4" offset="1936" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G5" acronym="CONTROLSS_PWMXBAR26_G5" offset="1940" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G6" acronym="CONTROLSS_PWMXBAR26_G6" offset="1944" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G7" acronym="CONTROLSS_PWMXBAR26_G7" offset="1948" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR26 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR26_G8" acronym="CONTROLSS_PWMXBAR26_G8" offset="1952" width="32" description="PWM XBAR 26 Input Select.">
		<bitfield id="PWMXBAR26_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR26 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G0" acronym="CONTROLSS_PWMXBAR27_G0" offset="1984" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR27 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G1" acronym="CONTROLSS_PWMXBAR27_G1" offset="1988" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR27 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G2" acronym="CONTROLSS_PWMXBAR27_G2" offset="1992" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR27 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G3" acronym="CONTROLSS_PWMXBAR27_G3" offset="1996" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR27 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G4" acronym="CONTROLSS_PWMXBAR27_G4" offset="2000" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G5" acronym="CONTROLSS_PWMXBAR27_G5" offset="2004" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G6" acronym="CONTROLSS_PWMXBAR27_G6" offset="2008" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G7" acronym="CONTROLSS_PWMXBAR27_G7" offset="2012" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR27 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR27_G8" acronym="CONTROLSS_PWMXBAR27_G8" offset="2016" width="32" description="PWM XBAR 27 Input Select.">
		<bitfield id="PWMXBAR27_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR27 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G0" acronym="CONTROLSS_PWMXBAR28_G0" offset="2048" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR28 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G1" acronym="CONTROLSS_PWMXBAR28_G1" offset="2052" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G1_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR28 G1 Input Select0:CMP8SS0.CTRIPL1:CMP8SS0.CTRIPH2:CMP8SS1.CTRIPL3:CMP8SS1.CTRIPH4:CMP8SS2.CTRIPL5:CMP8SS2.CTRIPH6:CMP8SS3.CTRIPL7:CMP8SS3.CTRIPH8:CMP8SS4.CTRIPL9:CMP8SS4.CTRIPH10:CMP8SS5.CTRIPL11:CMP8SS5.CTRIPH12:CMP8SS6.CTRIPL13:CMP8SS6.CTRIPH14:CMP8SS7.CTRIPL15:CMP8SS7.CTRIPH16:CMP8SS8.CTRIPL17:CMP8SS8.CTRIPH18:CMP8SS9.CTRIPL19:CMP8SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G2" acronym="CONTROLSS_PWMXBAR28_G2" offset="2056" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G2_SEL" width="24" begin="23" end="0" resetval="0x0" description="PWM XBAR28 G2 Input Select0:SDFM0.FILT1CEVT11:SDFM0.FILT1CEVT22:SDFM0.FILT1COMPHZ3:SDFM0.FILT2CEVT14:SDFM0.FILT2CEVT25:SDFM0.FILT2COMPHZ6:SDFM0.FILT3CEVT17:SDFM0.FILT3CEVT28:SDFM0.FILT3COMPHZ9:SDFM0.FILT4CEVT110:SDFM0.FILT4CEVT211:SDFM0.FILT4COMPHZ12:SDFM1.FILT1CEVT113:SDFM1.FILT1CEVT214:SDFM1.FILT1COMPHZ15:SDFM1.FILT2CEVT116:SDFM1.FILT2CEVT217:SDFM1.FILT2COMPHZ18:SDFM1.FILT3CEVT119:SDFM1.FILT3CEVT220:SDFM1.FILT3COMPHZ21:SDFM1.FILT4CEVT122:SDFM1.FILT4CEVT223:SDFM1.FILT4COMPHZ" range="23:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G3" acronym="CONTROLSS_PWMXBAR28_G3" offset="2060" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G3_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR28 G3 Input Select1:ADC0.EVT22:ADC0.EVT33:ADC0.EVT44:ADC1.EVT15:ADC1.EVT26:ADC1.EVT37:ADC1.EVT48:ADC2.EVT19:ADC2.EVT210:ADC2.EVT311:ADC2.EVT412:ADC3.EVT113:ADC3.EVT214:ADC3.EVT315:ADC3.EVT416:ADC4.EVT117:ADC4.EVT218:ADC4.EVT319:ADC4.EVT4" range="19:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G4" acronym="CONTROLSS_PWMXBAR28_G4" offset="2064" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G4_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G4 input bit select. Input source is INPUT XBAR.1:INPUT XBAR output bit[x] selected0:INPUT XBAR output bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G5" acronym="CONTROLSS_PWMXBAR28_G5" offset="2068" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G5_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G5 input bit select. Input source is PWM TRIPOUT.1:PWM TRIPOUT bit[x] selected0:PWM TRIPOUT bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G6" acronym="CONTROLSS_PWMXBAR28_G6" offset="2072" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G6_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G6 input bit select. Input source is PWM DEL TRIP1:PWM DEL TRIP bit[x] selected0:PWM DEL TRIP bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G7" acronym="CONTROLSS_PWMXBAR28_G7" offset="2076" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G7_SEL" width="32" begin="31" end="0" resetval="0x0" description="PWM XBAR28 G7 input bit select. Input source is PWM DEL ACTIVE1:PWM DEL ACTIVE bit[x] selected0:PWM DEL ACTIVE bit[x] is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR28_G8" acronym="CONTROLSS_PWMXBAR28_G8" offset="2080" width="32" description="PWM XBAR 28 Input Select.">
		<bitfield id="PWMXBAR28_G8_SEL" width="29" begin="28" end="0" resetval="0x0" description="PWM XBAR28 G8 Input Select0:EQEP0.ERR1:EQEP1.ERR2:EQEP2.ERR63:FSIRX0.RX_TRIG4107:FSIRX1.RX_TRIG41411:FSIRX2.RX_TRIG41815:FSIRX3.RX_TRIG4  2819:ECAP[9:0].TRIPOUT" range="28:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMXBAR29_G0" acronym="CONTROLSS_PWMXBAR29_G0" offset="2112" width="32" description="PWM XBAR 29 Input Select.">
		<bitfield id="PWMXBAR29_G0_SEL" width="20" begin="19" end="0" resetval="0x0" description="PWM XBAR29 G0 Input Select0:CMP12SS0.CTRIPL1:CMP12SS0.CTRIPH2:CMP12SS1.CTRIPL3:CMP12SS1.CTRIPH4:CMP12SS2.CTRIPL5:CMP12SS2.CTRIPH6:CMP12SS3.CTRIPL7:CMP12SS3.CTRIPH8:CMP12SS4.CTRIPL9:CMP12SS4.CTRIPH10:CMP12SS5.CTRIPL11:CMP12SS5.CTRIPH12:CMP12SS6.CTRIPL13:CMP12SS6.CTRIPH14:CMP12SS7.CTRIPL15:CMP12SS7.CTRIPH16:CMP12SS8.CTRIPL17:CMP12SS8.CTRIPH18:CMP12SS9.CTRIPL19:CMP12SS9.CTRIPH" range="19:0" rwaccess="R/W"/>
